Revit 2024 API
BuiltInFailures.RebarFailures.BarDiameterTooLarge Property
 Rebar Bar Diameter is too large.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BarDiameterTooLarge { get; }
Visual Basic
Public Shared ReadOnly Property BarDiameterTooLarge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BarDiameterTooLarge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace